Tekla.Structures.Drawing.Bolt.BoltAttributes
The BoltAttributes class is the attributes class for the bolt.

Tekla.Structures.Drawing.Bolt.BoltAttributes.Color
The color of the bolt.

Tekla.Structures.Drawing.Bolt.BoltAttributes.TrueColor
The true color (RGB enabled) of the bolt.
Throws System.ArgumentOutOfRangeException: The get method will
throw if the inputColor is not supported (0-7, 120 for example).
You should use this function in a try-catch statement, since
non-supported colors are used in TeklaStructures, especially in
older models. Define your own catch logic (default color, error
message, etc) based on your use case.

Tekla.Structures.Drawing.Bolt.BoltAttributes.Representation
The representation type of the bolt.

Tekla.Structures.Drawing.Bolt.BoltAttributes.SymbolContainsHole
True if the bolt symbol contains a hole.

Tekla.Structures.Drawing.Bolt.BoltAttributes.SymbolContainsAxis
True if the bolt symbol contains an axis.

Tekla.Structures.Drawing.Bolt.BoltAttributes.CustomPresentation
Custom presentation GUID to be applied to the bolt

Tekla.Structures.Drawing.Bolt.BoltAttributes.#ctor
Creates a new default bolt attributes instance that loads standard attributes.

Tekla.Structures.Drawing.Bolt.BoltAttributes.#ctor(System.Boolean)
Creates a new default bolt attributes instance that loads standard attributes.
SkipLoadingAttributes: If it set to true attributes won't be lodaded.

Tekla.Structures.Drawing.Bolt.BoltAttributes.#ctor(System.String)
Creates a new bolt attributes instance that loads the specified attributes.
AttributeFile: The filename of the attribute file.

Tekla.Structures.Drawing.Bolt.BoltAttributes.LoadAttributes(System.String)
Loads the attributes from the attribute file.
AttributeFile: The filename of the attribute file.
Returns: True if the attributes are loaded correctly. False if the attribute file loading failed.

Tekla.Structures.Drawing.Bolt.BoltAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.